src/tests/z.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/"
               xmlns:a="https://wp1.wirecard.com/TransactionNotification/Fleet">
    <soap:Header/>
    <soap:Body>
        <tem:TransactionNotificationRequest>
            <a:product>
                <a:productID>2272</a:productID>
                <a:productName>039-RHB TRAVEL CARD</a:productName>
                <a:programManager>RHB</a:programManager>
                <a:productCategory>Prepaid Card</a:productCategory>
                <a:subProductType>Consumer Travel Program</a:subProductType>
            </a:product>
            <a:businessAccount>
                <a:sourceBusinessName/>
                <a:sourceBusinessAccountNumber/>
                <a:businessName/>
                <a:businessAccountNumber/>
            </a:businessAccount>
            <a:card>
                <a:sourceCardNumber/>
                <a:sourceProxyNumber>0</a:sourceProxyNumber>
                <a:cardNumber>407092XXXXXX7407</a:cardNumber>
                <a:proxyNumber>60075</a:proxyNumber>
                <a:cardSequenceNumber>3</a:cardSequenceNumber>
            </a:card>
            <a:account>
                <a:sourceAccountNumber>0</a:sourceAccountNumber>
                <a:sourceAccountCurrency/>
                <a:sourceAccountBalanceInt/>
                <a:sourceAccountBalanceDec/>
                <a:AccountNumber>1003000000000104763</a:AccountNumber>
                <a:AccountCurrency>SGD</a:AccountCurrency>
                <a:AccountBalanceInt>13221</a:AccountBalanceInt>
                <a:AccountBalanceDec>71</a:AccountBalanceDec>
            </a:account>
            <a:transaction>
                <a:transactionId>27845890</a:transactionId>
                <a:transactionCode>9954</a:transactionCode>
                <a:transactionDescription>ATM Cash Withdrawal</a:transactionDescription>
                <a:transactionTimeStamp>22-May-2018 14:06:28 PM</a:transactionTimeStamp>
                <a:transactionLocalDate>22-May-2018</a:transactionLocalDate>
                <a:transactionLocalTime>14:06:28</a:transactionLocalTime>
                <a:transactionLifecycleState>O</a:transactionLifecycleState>
                <a:transactionOriginalId>0</a:transactionOriginalId>
                <a:messageTypeIdentifier>0200</a:messageTypeIdentifier>
                <a:transactionResponseCode>00</a:transactionResponseCode>
                <a:debitCreditFlag>-</a:debitCreditFlag>
                <a:logicModule>95</a:logicModule>
                <a:transactionPostingDate>22-May-2018</a:transactionPostingDate>
                <a:transactionPostingTime>18:06:28</a:transactionPostingTime>
                <a:postingFlag>0</a:postingFlag>
                <a:postingReference>Approved</a:postingReference>
                <a:postingTransactionSource>Visa SMS</a:postingTransactionSource>
                <a:originalTransactionSource>Visa SMS</a:originalTransactionSource>
            </a:transaction>
            <a:network>
                <a:networkName>VS</a:networkName>
                <a:networkTransactionId/>
                <a:networkProcessingCode>01</a:networkProcessingCode>
                <a:networkRRN>814210024289</a:networkRRN>
                <a:networkSTAN>024289</a:networkSTAN>
                <a:networkResponseCode>00</a:networkResponseCode>
            </a:network>
            <a:amounts>
                <a:sourcePostedCurrency/>
                <a:sourcePostedAmountInt/>
                <a:sourcePostedAmountDec/>
                <a:transactionCurrency>SGD</a:transactionCurrency>
                <a:transactionAmountInt>200</a:transactionAmountInt>
                <a:transactionAmountDec>00</a:transactionAmountDec>
                <a:billingCurrency>SGD</a:billingCurrency>
                <a:billingAmountInt>200</a:billingAmountInt>
                <a:billingAmountDec>00</a:billingAmountDec>
                <a:postedCurrency>SGD</a:postedCurrency>
                <a:postedAmountInt>200</a:postedAmountInt>
                <a:postedAmountDec>00</a:postedAmountDec>
                <a:additionalAmountCurrency/>
                <a:additionalAmountInt/>
                <a:additionalAmountDec/>
            </a:amounts>
            <a:fees/>
            <a:pos_merchant>
                <a:acquirerId/>
                <a:acquirerCountry>SG</a:acquirerCountry>
                <a:acquirerInstitutionIDCode>433755</a:acquirerInstitutionIDCode>
                <a:storeNumber/>
                <a:terminalId>S9218163</a:terminalId>
                <a:terminalType>A</a:terminalType>
                <a:terminalCategory>2</a:terminalCategory>
                <a:terminalEntry>5</a:terminalEntry>
                <a:cardAcceptorIDCode>TYME</a:cardAcceptorIDCode>
                <a:cardAcceptorterminalIDCode>S9218163</a:cardAcceptorterminalIDCode>
                <a:merchantId>TYME</a:merchantId>
                <a:merchantCode>6011</a:merchantCode>
                <a:merchantName>800 MARINE ST,</a:merchantName>
                <a:merchantAddress>800 MARINE ST, NY SG</a:merchantAddress>
                <a:merchantCity>NY</a:merchantCity>
                <a:merchantCountry>SG</a:merchantCountry>
                <a:merchantType>6011</a:merchantType>
                <a:posEntryMode>5</a:posEntryMode>
                <a:posConditionCode>0</a:posConditionCode>
                <a:posPINCaptureCode/>
                <a:nationalPOSGeographicData/>
                <a:chipCondition>0</a:chipCondition>
                <a:chipTransactionFlag/>
                <a:paymentIndicator/>
                <a:cardholderId>0</a:cardholderId>
            </a:pos_merchant>
            <a:fleet_48_data/>
            <a:fleet_104_data>
                <a:Quantity>0</a:Quantity>
                <a:Unit_Cost>0</a:Unit_Cost>
                <a:Gross_Fuel_Price>0</a:Gross_Fuel_Price>
                <a:Net_Fuel_Price>0</a:Net_Fuel_Price>
                <a:Gross_NonFuel_Price>0</a:Gross_NonFuel_Price>
                <a:Net_NonFuel_Price>0</a:Net_NonFuel_Price>
                <a:VAT_Rate>0</a:VAT_Rate>
                <a:Misc_FuelTax>0</a:Misc_FuelTax>
                <a:Misc_NonFuelTax>0</a:Misc_NonFuelTax>
                <a:Local_Tax>0</a:Local_Tax>
                <a:National_Tax>0</a:National_Tax>
                <a:Other_Tax>0</a:Other_Tax>
                <a:Summ_Comm_Code>0</a:Summ_Comm_Code>
            </a:fleet_104_data>
            <a:fleet_125_data>
                <a:expNonFuelCodeQty01>0</a:expNonFuelCodeQty01>
                <a:expNonFuelCodeCost01>0</a:expNonFuelCodeCost01>
                <a:expNonFuelCodeQty02>0</a:expNonFuelCodeQty02>
                <a:expNonFuelCodeCost02>0</a:expNonFuelCodeCost02>
                <a:expNonFuelCodeQty03>0</a:expNonFuelCodeQty03>
                <a:expNonFuelCodeCost03>0</a:expNonFuelCodeCost03>
                <a:expNonFuelCodeQty04>0</a:expNonFuelCodeQty04>
                <a:expNonFuelCodeCost04>0</a:expNonFuelCodeCost04>
                <a:expNonFuelCodeQty05>0</a:expNonFuelCodeQty05>
                <a:expNonFuelCodeCost05>0</a:expNonFuelCodeCost05>
                <a:expNonFuelCodeQty06>0</a:expNonFuelCodeQty06>
                <a:expNonFuelCodeCost06>0</a:expNonFuelCodeCost06>
                <a:expNonFuelCodeQty07>0</a:expNonFuelCodeQty07>
                <a:expNonFuelCodeCost07>0</a:expNonFuelCodeCost07>
                <a:expNonFuelCodeQty08>0</a:expNonFuelCodeQty08>
                <a:expNonFuelCodeCost08>0</a:expNonFuelCodeCost08>
            </a:fleet_125_data>
            <a:additionalData>
                <a:availableBalance>13221.71</a:availableBalance>
                <a:currentBalance>13221.71</a:currentBalance>
                <a:lastCreditAmount>789.00</a:lastCreditAmount>
                <a:lastCreditDate>22-May-2018</a:lastCreditDate>
                <a:lastTransactionDate>22-May-2018 18:06:28 PM</a:lastTransactionDate>
                <a:isDeclined>No</a:isDeclined>
                <a:transactionType>Settled</a:transactionType>
                <a:settleAmount>200.00</a:settleAmount>
                <a:settleCurrency>SGD</a:settleCurrency>
            </a:additionalData>
        </tem:TransactionNotificationRequest>
    </soap:Body>
</soap:Envelope>